#include <stdio.h>
#include <locale.h>
int main()
{
	setlocale(LC_ALL, "RUS");
	printf("123\n");
	printf("\n1\n2\n3");
	printf("\n\n1\n\t2\n\t\t3");
	printf("\n%d\n\t%d\n\t\t%d\n\t\t\t%d",1,2,3,4);
	printf("\n%10.3f\n",12.234657);
	printf("\n%10.5f\n", 12.234657);
	printf("Остаток от деления %d на %d равен %d\n",5,2,5%2);
	printf("Деление %d на %d равен %d, а остаток %d\n", 7, 5, 7/5,7%5);
	printf("Умножение %d на %d равен %d\n", 2000, 4, 2000 * 4);
	printf("%g разделить на %e равно %f\n",5.,2.,5./2);
	printf("%d разделить на %d равно %d\n", 5., 2., 5. / 2);
	printf("%f разделить на %f равно %f\n", 5., 2., 5. / 2);
	printf("%g разделить на %g равно %g\n", 5., 2., 5. / 2);
	printf("%e разделить на %e равно %e\n", 5., 2., 5. / 2);
	int N, K;
	N = 15;
	K = 02;
	printf("Сейчас %d часов %d минуты 00 секунд\n", N, K);
	printf("Идет %d минута суток\n", N*60 + K);
	printf("До полуночи осталось %d часов и %d минут\n", 24-N, 60-K);
	printf("С 8.00 прошло %d секунд\n", (((N - 8)*3600)+K*60));
	printf("Текущий час = %f суток и текущая минута = %f часа\n", 16./24, 30./60);
	int n, L, k;
	//13 вариант
	L = 133;
	n = 2;
	printf("Дано: \n\t%.3d \n\t%.3d\n", n, L);
	float k;
	k = n / L;
	printf("Ответ: \n\t%+2.2f", k);
}